Ran Plan for project: `sharedservices-prod` dir: `accounts/backstage-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.
Wrote /home/atlantis/.atlantis/nonprod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.backstage will be updated in-place
~ resource "aws_ecs_cluster" "backstage" {
        id       = "arn:aws:ecs:us-east-2:825765422855:cluster/backstage-cluster"
        name     = "backstage-cluster"
      ~ tags     = {
          + "Name" = "backstage-cluster"
        }
      ~ tags_all = {
          + "Name"       = "backstage-cluster"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.backstage will be updated in-place
~ resource "aws_ecs_service" "backstage" {
        id                                 = "arn:aws:ecs:us-east-2:825765422855:service/backstage-cluster/backstage-service"
        name                               = "backstage-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:25" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.backstage must be replaced
-/+ resource "aws_ecs_task_definition" "backstage" {
      ~ arn                      = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task:25" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:825765422855:task-definition/backstage-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - essential        = true
                  ~ image            = "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo@sha256:d1da3c0d59edb34687458b1e70c6c2b24f97240a6eaffbe65e52b560414754fa" -> "825765422855.dkr.ecr.us-east-2.amazonaws.com/backstage-repo@sha256:4e3cd1edd070eb6fb8589fd6d4e619fbfdd382e39a113d2a2cdd1323eaafcd19"
                  - mountPoints      = []
                    name             = "backstage"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (2 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "backstage-task" -> (known after apply)
      ~ revision                 = 25 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

  # aws_lb_target_group.backstage will be updated in-place
~ resource "aws_lb_target_group" "backstage" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:825765422855:targetgroup/backstage-tg/1f6e70dc5592d02c"
        name                               = "backstage-tg"
        tags                               = {
            "Name" = "backstage-tg"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/health" -> "/.backstage/health/v1/readiness"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_security_group_rule.allow_alb_to_ecs will be created
+ resource "aws_security_group_rule" "allow_alb_to_ecs" {
      + description              = "Allow ALB to reach Backstage ECS"
      + from_port                = 7007
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0000bd3857a940879"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d27436611dfd775b"
      + to_port                  = 7007
      + type                     = "ingress"
    }

Plan: 2 to add, 3 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fbackstage-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 2 to add, 3 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```